In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('data.csv')
df.head()

   Name  Age Department  Salary
0  John   28      Sales   50000
1  Jane   32         HR   60000
2  Dave   45         IT   70000
3   Sam   23  Marketing   45000

In [3]:
df[['Name', 'Salary']]

   Name  Salary
0  John   50000
1  Jane   60000
2  Dave   70000
3   Sam   45000

In [4]:
df[df['Age'] > 30]

   Name  Age Department  Salary
1  Jane   32         HR   60000
2  Dave   45         IT   70000

In [5]:
df['Bonus'] = df['Salary'] * 0.1
df.head()

   Name  Age Department  Salary   Bonus
0  John   28      Sales   50000  5000.0
1  Jane   32         HR   60000  6000.0
2  Dave   45         IT   70000  7000.0
3   Sam   23  Marketing   45000  4500.0

In [9]:
df.dtypes

Name           object
Age             int64
Department     object
Salary          int64
Bonus         float64
dtype: object

In [11]:
df_grouped = df.groupby('Department')[['Age', 'Salary', 'Bonus']].mean()
df_grouped

             Age   Salary   Bonus
Department
HR          32.0  60000.0  6000.0
IT          45.0  70000.0  7000.0
Marketing   23.0  45000.0  4500.0
Sales       28.0  50000.0  5000.0